---
kind: method
id: M:Autodesk.Revit.DB.ExportLineweightTableIterator.Dispose
source: html/be216377-f4c1-82e4-46a1-48b7f71b8627.htm
---
# Autodesk.Revit.DB.ExportLineweightTableIterator.Dispose Method

Releases all resources used by the ExportLineweightTableIterator

## Syntax (C#)
```csharp
public void Dispose()
```